Catalogs/ГруппыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ГруппыПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдминистраторГруппы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПользователиГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НастройкиПравДоступаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПравДоступаПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Чтение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидНаследованияПравДоступаИерархическихСправочников</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНаследованияПравДоступаИерархическихСправочников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнешниеОбработки</v8:Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъектаДоступа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбластьДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбластиДанныхОбъектовДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецПравДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнешниеОбработки</v8:Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаследованаОтВсеПользователи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ГруппыПользователей/Ext/ObjectModule.bsl
Перем УдалятьЗаписиНастройкиПрав;

Перем УдалятьНастройкиПравБезПредупреждений Экспорт;

Перем ПроверятьНаследуемыеПрава;


Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверятьНаследуемыеПрава = ЭтоНовый();
	
	УдалитьПриНеобходимостиНастройкиПравДоступа();
	
КонецПроцедуры

Процедура УдалитьПриНеобходимостиНастройкиПравДоступа()
	
	Если Не ЭтоНовый() И ПометкаУдаления Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	1 КАК Поле1
		               |ИЗ
		               |	Справочник.ГруппыПользователей КАК ГруппыПользователей
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПравДоступаПользователей КАК НастройкиПравДоступа
		               |		ПО НастройкиПравДоступа.Пользователь = ГруппыПользователей.Ссылка
		               |ГДЕ
		               |	ГруппыПользователей.Ссылка = &Ссылка
		               |	И (НЕ ГруппыПользователей.ПометкаУдаления)";
					   
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Если НЕ УдалятьНастройкиПравБезПредупреждений Тогда
				#Если Клиент Тогда
					ОтветНаВопрос = Вопрос("Удалить настройки прав доступа связанные с группой """ + Наименование + """ (без возможности их восстановления)?", РежимДиалогаВопрос.ДаНет);
					УдалятьЗаписиНастроек = (ОтветНаВопрос = КодВозвратаДиалога.Да);				
				#Иначе
					УдалятьЗаписиНастроек = Истина;
				#КонецЕсли			
			Иначе
				УдалятьЗаписиНастроек = Истина;
			КонецЕсли;
			
			Если УдалятьЗаписиНастроек Тогда
				Набор = РегистрыСведений.НастройкиПравДоступаПользователей.СоздатьНаборЗаписей();
				Набор.Отбор.Пользователь.Установить(Ссылка);
				Набор.Записать();			
			КонецЕсли;			
		КонецЕсли;
		
	ИначеЕсли Не ЭтоНовый() И НЕ ПометкаУдаления Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Справочник.ГруппыПользователей ГДЕ Ссылка = &Ссылка И ПометкаУдаления";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			ЗаписатьУнаследованныеПраваДляВсехГрупп();
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ПроверятьНаследуемыеПрава Тогда
		ЗаписатьУнаследованныеПраваДляВсехГрупп();		
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьУнаследованныеПраваДляВсехГрупп()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяГруппа", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПравДоступаПользователей.ОбъектДоступа,
	|	&ТекущаяГруппа КАК Пользователь,
	|	НастройкиПравДоступаПользователей.ВидОбъектаДоступа,
	|	НастройкиПравДоступаПользователей.ОбластьДанных,
	|	НастройкиПравДоступаПользователей.ВладелецПравДоступа,
	|	ИСТИНА КАК НаследованаОтВсеПользователи,
	|	НастройкиПравДоступаПользователей.Чтение,
	|	НастройкиПравДоступаПользователей.Запись,
	|	НастройкиПравДоступаПользователей.ВидНаследованияПравДоступаИерархическихСправочников
	|ИЗ
	|	РегистрСведений.НастройкиПравДоступаПользователей КАК НастройкиПравДоступаПользователей
	|ГДЕ
	|	НастройкиПравДоступаПользователей.Пользователь = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ПустаяСсылка)";

	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Набор = РегистрыСведений.НастройкиПравДоступаПользователей.СоздатьНаборЗаписей();
		Набор.Отбор.Пользователь.Установить(Ссылка);
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Набор.Добавить(), Выборка);
		КонецЦикла;
		Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры

УдалятьНастройкиПравБезПредупреждений = Ложь;
ПроверятьНаследуемыеПрава = Ложь;
